#+TITLE: Advent Of Code 2020
#+PROPERTY: header-args+ :var Input="" InputFromFile=1 Debug=0 Verbose=1 :tangle no :shebang "#!/usr/bin/env python3"

#+begin_src python :noweb-ref utl-pretty-print :results none :exports none
import pprint
pp = pprint.PrettyPrinter(indent=2, width=120)
#+end_src

#+begin_src python :noweb-ref utl-parse-input :results none :exports none
def ParseInput(postProcess=lambda x:x):
    global Input, InputFromFile
    lines = []

    if InputFromFile:
        fin = open(Input)
        lines = [ line.strip('\n') for line in fin.readlines() ]
        fin.close()
    else:
        lines = Input.strip('\n').split('\n')

    return list(map(postProcess, lines))
#+end_src

** Part 2

#+begin_src python :var Input="4_in.txt"
<<utl-pretty-print>>
import re
<<day4_utl>>

def IsValidHeight(val):
    m = re.compile('^(?P<height>\d+)(?P<unit>in|cm)$').search(val)
    if m == None:
        return False
    height = int(m.group('height'))
    if (m.group('unit') == 'cm') and (height in range(150, 194)):
        return True
    if (m.group('unit') == 'in') and (height in range(59, 77)):
        return True
    return False

def IsValidHairColor(val):
    return re.compile('^#[0-9a-f]{6}$').search(val)

def IsValidEyeColor(val):
    return val in ['amb', 'blu', 'brn', 'gry', 'grn', 'hzl', 'oth']

def IsValidPassportId(val):
    return re.compile('^\d{9}$').search(val)

def IsValid(passport):
    for field in RequiredFields:
        if field not in passport.keys():
            return False
        val = passport[field]

        if (field == 'byr') and (int(val) not in range(1920, 2003)):
            return False

        if (field == 'iyr') and (int(val) not in range(2010, 2021)):
            return False

        if (field == 'eyr') and (int(val) not in range(2020, 2031)):
            return False

        if (field == 'hgt') and not IsValidHeight(val):
            return False

        if (field == 'hcl') and not IsValidHairColor(val):
            return False

        if (field == 'ecl') and not IsValidEyeColor(val):
            return False

        if (field == 'pid') and not IsValidPassportId(val):
            return False

    return True

NumValidPassports = 0
for passport in MakeRecords(ParseInput(Input)):
    if IsValid(passport):
        NumValidPassports += 1

print("NumValidPassports=", NumValidPassports, sep='')
#+end_src

#+RESULTS:
: NumValidPassports=175

** Part 2
#+begin_src python :var Input="5_in.txt"
<<day5_utl>>

validSeatIds = []
for line in Lines:
    validSeatIds.append(GetSeatId(line))
validSeatIds.sort()

for seatId in range(validSeatIds[0], validSeatIds[-1]):
    if seatId in validSeatIds:
        continue

    if ((seatId - 1) in validSeatIds) and ((seatId + 1) in validSeatIds):
        print("SeatId=", seatId, sep='')
        break
#+end_src

#+RESULTS:
: SeatId=599

** Part 2
#+name: day10_p2_impl
#+begin_src python
<<utl-pretty-print>>
<<day10_utl>>

# Store no. of arrangements for visited elements to reduce recursion
NumArrangementsFor={}

def CountArrangements(initList=[Lines[0]]):
    global Lines, NumArrangementsFor

    if initList[-1] == Lines[-1]:
        return 1

    totArrangements = 0
    initLastIdx = Lines.index(initList[-1])
    chkList = Lines[initLastIdx + 1:]

    for chkNum in chkList:
        if chkNum - initList[-1] <= 3:
            if chkNum not in NumArrangementsFor:
                NumArrangementsFor[chkNum] = CountArrangements(initList + [chkNum])
            totArrangements += NumArrangementsFor[chkNum]
        else:
            break

    return totArrangements


totArrangements = CountArrangements()
print("Total no. of arrangements=", totArrangements, sep='')
#+end_src

#+call: day10_p2_impl(Input=day10_eg1.in, InputFromFile=0)

#+RESULTS:
: Total no. of arrangements=8

#+call: day10_p2_impl(Input=day10_eg2.in, InputFromFile=0)

#+RESULTS:
: Total no. of arrangements=19208

#+begin_src python :var Input="10_in.txt" :tangle day10_p2.py
<<day10_p2_impl>>
#+end_src

#+RESULTS:
: Total no. of arrangements=193434623148032

** Part 2
#+name: day14_p2_eg.in
#+begin_example
mask = 000000000000000000000000000000X1001X
mem[42] = 100
mask = 00000000000000000000000000000000X0XX
mem[26] = 1
#+end_example

#+name: day14_p2_impl
#+begin_src python
<<day14_utl>>

FloatBits = []
for line in Lines:
    op = ParseInstr(line)
    if op['Cmd'] == "Mask":
        Mask0 = op['Mask0']
        Mask1 = op['Mask1']
        MaskX = op['MaskX']

        FloatLoc = []
        val = 1
        while val <= MaskX:
            if MaskX & val != 0:
                FloatLoc += [i + val for i in FloatLoc] if len(FloatLoc) != 0 else [0, val]
            val = val << 1

        print(line, ": Mask1=", Mask1, ", MaskX=", MaskX, ", FloatLoc=", FloatLoc, sep='') if Debug else None

    else:
        print(line) if Debug else None
        for loc in FloatLoc:
            memLoc = loc + ((op['Loc'] & ~MaskX) | Mask1)
            Mem[memLoc] = op['Val']

pp.pprint(Mem) if Debug else None
memSum = sum(Mem.values())
print("Sum of all elements in Memory=", memSum, sep='') if Verbose else None
#+end_src

#+call: day14_p2_impl(Input=day14_p2_eg.in, InputFromFile=0, Debug=1)

#+RESULTS:
: mask = 000000000000000000000000000000X1001X: Mask1=18, MaskX=33, FloatLoc=[0, 1, 32, 33]
: mem[42] = 100
: mask = 00000000000000000000000000000000X0XX: Mask1=0, MaskX=11, FloatLoc=[0, 1, 2, 3, 8, 9, 10, 11]
: mem[26] = 1
: {16: 1, 17: 1, 18: 1, 19: 1, 24: 1, 25: 1, 26: 1, 27: 1, 58: 100, 59: 100}
: Sum of all elements in Memory=208

#+begin_src python :var Input="14_in.txt" :tangle day14_p2.py
<<day14_p2_impl>>
#+end_src

#+RESULTS:
: Sum of all elements in Memory=2900994392308

** Part 1
#+name: day17_p1_impl
#+begin_src python
<<utl-pretty-print>>

<<utl-parse-input>>

def ProcessInput():
    global Grid, LimX, LimY, LimZ

    lines = ParseInput()
    LimY = range(0, len(lines))
    LimX = range(0, len(lines[0]))
    LimZ = range(0, 1)
    Grid = set()

    for y in LimY:
        for x in LimX:
            Grid.add((x,y,0)) if lines[y][x] == "#" else None
ProcessInput()

def PrintGrid():
    global Grid, LimX, LimY, LimZ

    # Now print it
    for z in LimZ:
        print("z=", z, sep='')
        for y in LimY:
            print("  ", end="")
            for x in LimX:
                print("#" if (x,y,z) in Grid else ".", end="")
            print()
        print()

def GetNumActiveNeighbors(x, y, z):
    numActiveNeighbors = 0
    for i in range(x-1,x+2):
        for j in range(y-1,y+2):
            for k in range(z-1,z+2):
                if (i,j,k) == (x,y,z):
                    continue
                numActiveNeighbors += 1 if (i,j,k) in Grid else 0
    return numActiveNeighbors

def DoCycle(numIter=1):
    global Grid, LimX, LimY, LimZ

    for iter in range(numIter):
        # We need to look 1 unit farther in each direction and evaluate
        LimX=range(LimX.start - 1, LimX.stop + 1)
        LimY=range(LimY.start - 1, LimY.stop + 1)
        LimZ=range(LimZ.start - 1, LimZ.stop + 1)

        newGrid = set()
        for z in LimZ:
            for y in LimY:
                for x in LimX:
                    getNumActiveNeighbors = GetNumActiveNeighbors(x, y, z)
                    # print((x,y,z), ": NumNeighbors=", getNumActiveNeighbors)
                    if (x,y,z) in Grid and (getNumActiveNeighbors in range(2,4)):
                        newGrid.add((x,y,z))
                    if (x,y,z) not in Grid and (getNumActiveNeighbors == 3):
                        newGrid.add((x,y,z))

        Grid = newGrid

DoCycle(6)
print("Num active cubes=", len(Grid), sep='')
#+end_src

#+call: day17_p1_impl(Input=day17_eg.in, InputFromFile=0, Debug=1)

#+RESULTS:
: Num active cubes=112

#+begin_src python :var Input="17_in.txt" :tangle day17_p1.py
<<day17_p1_impl>>
#+end_src

#+RESULTS:
: Num active cubes=271

** Part 2
#+name: day17_p2_impl
#+begin_src python
<<utl-pretty-print>>

<<utl-parse-input>>

def ProcessInput():
    global Grid, LimX, LimY, LimZ, LimW

    lines = ParseInput()
    LimY = range(0, len(lines))
    LimX = range(0, len(lines[0]))
    LimZ = range(0, 1)
    LimW = range(0, 1)
    Grid = set()

    for y in LimY:
        for x in LimX:
            Grid.add((x,y,0,0)) if lines[y][x] == "#" else None
ProcessInput()

def PrintGrid():
    global Grid, LimX, LimY, LimZ, LimW

    # Now print it
    for w in LimW:
        for z in LimZ:
            print("w=", w, ", z=", z, sep='')
            for y in LimY:
                print("  ", end='')
                for x in LimX:
                    print("#" if (x,y,z,w) in Grid else ".", end="")
                print()
            print()

def GetNumActiveNeighbors(x, y, z, w):
    numActiveNeighbors = 0
    for i in range(x-1,x+2):
        for j in range(y-1,y+2):
            for k in range(z-1,z+2):
                for l in range(w-1,w+2):
                    if (i,j,k,l) == (x,y,z,w):
                        continue
                    numActiveNeighbors += 1 if (i,j,k,l) in Grid else 0
    return numActiveNeighbors

def DoCycle(numIter=1):
    global Grid, LimX, LimY, LimZ, LimW

    for iter in range(numIter):
        # We need to look 1 unit farther in each direction and evaluate
        LimX=range(LimX.start - 1, LimX.stop + 1)
        LimY=range(LimY.start - 1, LimY.stop + 1)
        LimZ=range(LimZ.start - 1, LimZ.stop + 1)
        LimW=range(LimW.start - 1, LimW.stop + 1)

        newGrid = set()
        for w in LimW:
            for z in LimZ:
                for y in LimY:
                    for x in LimX:
                        getNumActiveNeighbors = GetNumActiveNeighbors(x, y, z, w)
                        # print((x,y,z), ": NumNeighbors=", getNumActiveNeighbors)
                        if (x,y,z,w) in Grid and (getNumActiveNeighbors in range(2,4)):
                            newGrid.add((x,y,z,w))
                        if (x,y,z,w) not in Grid and (getNumActiveNeighbors == 3):
                            newGrid.add((x,y,z,w))

        Grid = newGrid

DoCycle(6)
print("Num active cubes=", len(Grid), sep='')
#+end_src

#+call: day17_p2_impl(Input=day17_eg.in, InputFromFile=0, Debug=1)

#+RESULTS:
: Num active cubes=848

#+begin_src python :var Input="17_in.txt" :tangle day17_p2.py
<<day17_p2_impl>>
#+end_src

#+RESULTS:
: Num active cubes=2064

